# ItemIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..ItemIndex Property
RebarContainerItem Class See Also
---
The index of this item in its associated RebarContainer.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ItemIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ItemIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int ItemIndex {
	int get ();
}
```

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace